Tekla Open API Reference for Tekla Structures 2025
ModelViewEnumerator.Current Property
Returns the current view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View Current { get; }
Public ReadOnly Property Current As View
	Get
Property Value
Type: View
See Also
Reference
ModelViewEnumerator Class
Tekla.Structures.Model.UI Namespace